; domain
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (domain lunar-logistics)
;(:requirements :typing :fluents)
(:types surface_unit outpost - object
  rover crew - surface_unit)
(:predicates (stationed ?x - surface_unit  ?c - outpost)
             (aboard ?p - crew ?a - rover))
(:functions (regolith ?a - rover)
            (gap ?c1 - outpost ?c2 - outpost)
            (idle-draw ?a - rover)
            (rush-draw ?a - rover)
            (hopper ?a - rover)
            (total-regolith-spent)
      (occupants ?a - rover)
            (rush-cap ?a - rover)
            )


(:action embark_crew
 :parameters (?p - crew ?a - rover ?c - outpost)
 :precondition (and (stationed ?p ?c)
                 (stationed ?a ?c))
 :effect (and (not (stationed ?p ?c))
              (aboard ?p ?a)
    (increase (occupants ?a) 1)))


(:action disembark_crew
 :parameters (?p - crew ?a - rover ?c - outpost)
 :precondition (and (aboard ?p ?a)
                 (stationed ?a ?c))
 :effect (and (not (aboard ?p ?a))
              (stationed ?p ?c)
    (decrease (occupants ?a) 1)))

(:action traverse-idle
 :parameters (?a - rover ?c1 ?c2 - outpost)
 :precondition (and (stationed ?a ?c1)
                 (>= (regolith ?a)
                         (* (gap ?c1 ?c2) (idle-draw ?a))))
 :effect (and (not (stationed ?a ?c1))
              (stationed ?a ?c2)
              (increase (total-regolith-spent)
                         (* (gap ?c1 ?c2) (idle-draw ?a)))
              (decrease (regolith ?a)
                         (* (gap ?c1 ?c2) (idle-draw ?a)))))

(:action traverse-rush
 :parameters (?a - rover ?c1 ?c2 - outpost)
 :precondition (and (stationed ?a ?c1)
                 (>= (regolith ?a)
                         (* (gap ?c1 ?c2) (rush-draw ?a)))
                 (<= (occupants ?a) (rush-cap ?a)))
 :effect (and (not (stationed ?a ?c1))
              (stationed ?a ?c2)
              (increase (total-regolith-spent)
                         (* (gap ?c1 ?c2) (rush-draw ?a)))
              (decrease (regolith ?a)
                         (* (gap ?c1 ?c2) (rush-draw ?a)))
  )
)

(:action refill_regolith
 :parameters (?a - rover)
 :precondition (and (> (hopper ?a) (regolith ?a))

    )
 :effect (and (assign (regolith ?a) (hopper ?a)))
)


)

; problem
(define (problem lunar-logistics-p05)
(:domain lunar-logistics)
(:objects
  rover1 - rover
  rover2 - rover
  crew1 - crew
  crew2 - crew
  outpost0 - outpost
  outpost1 - outpost
  )
(:init
  (stationed rover1 outpost0)
  (stationed rover2 outpost1)
  (= (hopper rover1) 5000)
  (= (regolith rover1) 3000)
  (= (idle-draw rover1) 3)
  (= (rush-draw rover1) 10)
  (= (occupants rover1) 0)
  (= (rush-cap rover1) 5)
  (= (hopper rover2) 5000)
  (= (regolith rover2) 3000)
  (= (idle-draw rover2) 3)
  (= (rush-draw rover2) 10)
  (= (occupants rover2) 0)
  (= (rush-cap rover2) 5)
  (stationed crew1 outpost0)
  (stationed crew2 outpost1)
  (= (gap outpost0 outpost0) 0)
  (= (gap outpost0 outpost1) 450)
  (= (gap outpost1 outpost0) 450)
  (= (gap outpost1 outpost1) 0)
  (= (total-regolith-spent) 0)
)
(:goal (and
  (stationed crew1 outpost1)
  (stationed crew2 outpost0)
  ))
(:metric minimize (total-regolith-spent))
)

; plan
1. (embark_crew crew1 rover1 outpost0)
   deleted: (stationed crew1 outpost0)
   added: (aboard crew1 rover1)
   changed: (occupants rover1) from 0 to 1
   goals met: 0 of 2
2. (traverse-idle rover1 outpost0 outpost1)
   deleted: (stationed rover1 outpost0)
   added: (stationed rover1 outpost1)
   changed: (total-regolith-spent) from 0 to 1350, (regolith rover1) from 3000 to 1650
   goals met: 0 of 2
3. (embark_crew crew2 rover2 outpost1)
   deleted: (stationed crew2 outpost1)
   added: (aboard crew2 rover2)
   changed: (occupants rover2) from 0 to 1
   goals met: 0 of 2
4. (traverse-idle rover2 outpost1 outpost0)
   deleted: (stationed rover2 outpost1)
   added: (stationed rover2 outpost0)
   changed: (total-regolith-spent) from 1350 to 2700, (regolith rover2) from 3000 to 1650
   goals met: 0 of 2
5. (refill_regolith rover2)
   changed: (regolith rover2) from 1650 to 5000
   goals met: 0 of 2
6. (disembark_crew crew1 rover1 outpost1)
   deleted: (aboard crew1 rover1)
   added: (stationed crew1 outpost1)
   changed: (occupants rover1) from 1 to 0
   goals met: 1 of 2
7. (disembark_crew crew2 rover2 outpost0)
   deleted: (aboard crew2 rover2)
   added: (stationed crew2 outpost0)
   changed: (occupants rover2) from 1 to 0
   goals met: 2 of 2
